# IFCHybrid Import Options Hybrid Grids Property

Source: https://www.revitapidocs.com/2026/2880f65b-bc9a-e511-5a33-e4c39f4598b7.htm

---

| IFCHybrid Import Options Hybrid Grids Property |
| --- |

True if we should use AnyCAD to process grids, false otherwise.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool HybridGrids { get; }
```

```
Public ReadOnly Property HybridGrids As Boolean
	Get
```

```
public:
property bool HybridGrids {
	bool get ();
}
```

```
member HybridGrids : bool with get
```

#### Property Value

Boolean See Also

#### Reference

IFCHybridImportOptions Class Autodesk.Revit.DB.IFC Namespace